app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 1]]
SELECT COUNT(*) AS count_all, "seats"."seat_class_id" AS seats_seat_class_id FROM "seats" GROUP BY "seats"."seat_class_id"
SELECT  "seat_classes".* FROM "seat_classes" WHERE "seat_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @flights = Flight.all
    @open_flights = []
    @closed_flights = []

    @flights.each do |f|
      if f.seats.length >= f.capacity then
        @closed_flights.append(f)
      else
        @open_flights.append(f)
      end
      @result = Seat.all.group(:seat_class_id).count

      @chart_data = {}

      @result.each do |k ,v |
          @chart_data[SeatClass.find(k).class_name] =v

INSERT INTO "flights" ("departure", "arrival", "destination", "baggage_allowance", "capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save

UPDATE "flights" SET "baggage_allowance" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["baggage_allowance", 1000.0], ["updated_at", "2019-06-11 10:23:43.629035"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @flight.update(flight_params)